["Reserved", "<T01>", "<T02>", "<T03>", "<T04>", "<T05>", "<T06>", "<T07>", "<T08>", "<T09>", "<T10>", "<T11>", "<T12>", "<T13>", "<T14>", "UNK", "SOS", "EOS", "api_call", "<SILENCE>", "'d", "'m", "'re", "'s", ",", ".", "01223", "1", "108", "17", "2", "3", "323737", "4", "529", "7", "7:30", ":", ";", "<", ">", "?", "C.B", "Cambridge", "Can", "Centre", "Chesterton", "City", "Could", "D.P", "Did", "Ditton", "Fen", "Hello", "How", "I", "L.E", "Let", "Magdalene", "Milton", "N.F", "Newmarket", "Ok", "Regent", "Road", "SILENCE", "Sorry", "Street", "Sure", "That", "The", "Their", "There", "U.F", "What", "Would", "You", "a", "able", "about", "actually", "ad", "adddress", "addre", "address", "addresses", "addrss", "adra", "adress", "af", "afghan", "africa", "african", "after", "afternoon", "again", "ah", "air", "airatarin", "airitran", "all", "alright", "alternative", "am", "american", "an", "anatolia", "and", "another", "answer", "any", "anyone", "anything", "anywhere", "appleton", "ar", "are", "area", "areas", "aristrain", "arotrian", "art", "arts", "as", "asian", "ask", "at", "austallison", "austral", "australasian", "australia", "australian", "austria", "austrian", "austro", "available", "aw", "awesome", "b", "back", "bad", "bangkok", "bar", "barbecue", "barbeque", "bart", "bask", "baskaye", "baskey", "basque", "bat", "be", "because", "bedouin", "before", "beijing", "belgain", "belgian", "belgium", "believe", "beside", "besides", "bistro", "bit", "bloomsbury", "blow", "bombay", "book", "both", "bout", "bra", "brazilian", "breath", "breathing", "bristish", "british", "burger", "but", "by", "bye", "c", "ca", "caius", "calling", "cambridge", "can", "cana", "canap", "canape", "canapes", "cancun", "cannabis", "canope", "canopus", "cant", "cantonates", "cantonese", "care", "caribbean", "carraibean", "castro", "cata", "catalan", "catalanian", "catalen", "catalin", "catalonia", "center", "central", "centre", "change", "changed", "che", "cheap", "cherries", "chi", "chikkis", "chineese", "chinese", "chinses", "chiquito", "choice", "christ", "christmas", "city", "class", "co", "cocum", "code", "college", "confirm", "confused", "continental", "cool", "correct", "corsica", "cost", "cote", "cotto", "cough", "could", "cow", "creative", "croatia", "cross", "crossover", "crosstalk", "cuban", "cuisine", "currently", "cut", "cute", "d", "da", "damn", "danish", "darling", "day", "dear", "decide", "deosnt", "derately", "did", "different", "dish", "do", "does", "doesnt", "done", "dont", "downtown", "dr", "dress", "dubai", "e", "ea", "earatrain", "earatree", "earetree", "eartrain", "east", "eat", "ecuadorean", "eight", "eirtrean", "either", "else", "endonesian", "english", "er", "eraina", "eritrean", "euorpean", "euro", "europ", "europea", "european", "europene", "europone", "ever", "every", "everything", "excellent", "expe", "expen", "expensive", "expnsive", "f", "fast", "fdod", "feed", "ffood", "finally", "find", "fine", "finished", "first", "foo", "food", "foods", "for", "fora", "forget", "four", "fre", "freakin", "free", "french", "from", "fuck", "fucking", "fusion", "galleria", "garden", "gardens", "gasper", "gastro", "gastropub", "ger", "germ", "german", "get", "give", "go", "god", "gonville", "good", "goodb", "goodbye", "got", "graffiti", "great", "greek", "grill", "h", "hakka", "halal", "halo", "hang", "hanoi", "has", "hate", "have", "he", "hear", "hello", "help", "here", "hey", "hi", "hindi", "his", "hm", "hold", "holy", "hotel", "house", "how", "huh", "hungarian", "i", "iam", "id", "if", "ill", "im", "in", "inaudible", "includes", "incorrect", "ind", "india", "indian", "indians", "indo", "indonesian", "inexpensive", "information", "inner", "instead", "int", "interested", "international", "into", "irish", "is", "isian", "it", "itailian", "ital", "italian", "its", "jamaica", "jamaican", "jamcian", "japanese", "jesus", "just", "k", "kay", "killeen", "kind", "kitalian", "kitchen", "knocking", "know", "ko", "kohinoor", "kor", "korea", "korean", "kosher", "kymmoy", "l", "labenese", "labonese", "last", "laugh", "laughing", "lcoated", "least", "leban", "lebanese", "let", "lets", "like", "list", "listen", "located", "location", "london", "long", "loo", "look", "looking", "looks", "loooking", "love", "low", "luck", "ly", "m", "madrid", "mail", "make", "malaysian", "malyasian", "many", "matches", "mater", "matter", "may", "me", "meant", "medetanian", "mediteranean", "mediteranian", "mediterranean", "meditteranian", "medium", "medterranean", "meghna", "mexican", "mia", "middle", "might", "mind", "minuet", "missing", "mistakes", "mmhm", "moder", "moderat", "moderate", "moderately", "moderatley", "modereate", "modern", "modernity", "modertley", "modreately", "moment", "more", "morning", "moroccan", "moroccon", "moron", "much", "music", "my", "n't", "na", "name", "nandos", "ne", "near", "need", "needs", "new", "next", "nice", "no", "noice", "none", "nor", "north", "nosie", "not", "nothing", "now", "nt", "nu", "nubmer", "number", "numbere", "numeber", "nymber", "o", "of", "offer", "oh", "ok", "okay", "old", "on", "one", "ones", "ooh", "opean", "option", "options", "or", "ori", "oriental", "ostro", "ot", "other", "others", "out", "over", "p", "pan", "panahar", "panasian", "par", "paris", "park", "part", "parts", "party", "peace", "people", "perfect", "persian", "ph", "phone", "pick", "pizza", "place", "plea", "pleas", "please", "po", "polish", "pollynasian", "polynesia", "polynesian", "popular", "port", "portugese", "portugeuse", "portuguese", "post", "postal", "postcode", "prefer", "preference", "previews", "prezzo", "prezzos", "pri", "price", "priced", "pricerange", "prices", "prise", "probably", "promo", "provide", "pub", "rage", "rajmahal", "ran", "range", "ranges", "re", "really", "recommend", "regular", "repeat", "request", "rerestaurant", "res", "resataurant", "reservation", "reset", "rest", "restaraunt", "restaruant", "restauarant", "restaura", "restauran", "restaurant", "restaurants", "restaurnt", "restsurant", "restuarant", "resturant", "right", "ring", "ringing", "river", "rock", "romanian", "rome", "russian", "s", "said", "salad", "sales", "say", "saying", "says", "scandin", "scandinavia", "scandinavian", "scotch", "scottish", "sea", "seafood", "searching", "sec", "see", "selection", "selling", "sells", "seoul", "ser", "serve", "served", "servers", "serves", "servess", "serving", "sh", "shou", "should", "show", "shows", "side", "sigh", "signa", "signaporian", "signature", "singapore", "singaporean", "six", "so", "sock", "some", "something", "somewhere", "sorry", "sounds", "south", "spani", "spanish", "spensive", "spice", "start", "static", "staurant", "steak", "steakhouse", "stop", "such", "sucks", "suggestion", "suggestions", "sure", "surprise", "swedish", "sweedish", "swiss", "system", "t", "table", "take", "takeaway", "takes", "talian", "talk", "talking", "taquita", "tasty", "telephone", "tell", "th", "tha", "thai", "thailand", "than", "thank", "thanks", "thare", "that", "thatll", "thats", "the", "their", "them", "then", "there", "theres", "they", "thing", "things", "think", "this", "those", "though", "thr", "time", "to", "today", "tokyo", "told", "tow", "town", "traditional", "train", "tran", "try", "trying", "ts", "tur", "turk", "turkey", "turkiesh", "turkish", "tuscan", "two", "ty", "type", "types", "uh", "um", "umh", "unintellgible", "unintelligent", "unitelligible", "unusal", "unusual", "up", "update", "us", "usually", "vanessa", "vegetarian", "vegitarian", "veitnamese", "ven", "venesian", "venetian", "venison", "venue", "venues", "very", "viet", "vietna", "vietnam", "vietnamese", "vinci", "vinesha", "wagamama", "wait", "wan", "want", "wanted", "was", "water", "we", "welch", "welcome", "well", "welsh", "were", "west", "wha", "what", "whats", "where", "wheres", "which", "who", "will", "wiscon", "with", "wondering", "work", "working", "world", "worth", "worthless", "would", "wouth", "wrong", "ya", "yawning", "ye", "yea", "yeah", "yes", "york", "you", "your", "yourself", "zip"]